Ran Plan for 11 projects:

1. dir: `infra/us-east-1/prod/eks/green/application-secrets` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/cluster` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/honeycomb` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/grafana-agent` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/eks` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/eks-addons` workspace: `default`
1. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
1. dir: `infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
1. dir: `infra/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`

### 4. dir: `infra/us-east-1/prod/eks/green/grafana-agent` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/grafana-agent": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/grafana-agent": 
time=2024-02-02T13:15:01Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/eks] 
time=2024-02-02T13:15:11Z level=error msg=chdir /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/global/route53/records/us-east-2.vpce.grafana.net/.terragrunt-cache/886574370: no such file or directory
time=2024-02-02T13:15:11Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 5. dir: `infra/us-east-1/dev/eks/cluster-addons` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/cluster-addons": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/cluster-addons": 
time=2024-02-02T13:12:38Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/cluster] 
time=2024-02-02T13:13:45Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/modules/eks/addons. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addon_aws_ebs_csi_driver...
- eks_addon_aws_ebs_csi_driver in .terraform/modules/eks_addon_aws_ebs_csi_driver
Downloading registry.terraform.io/terraform-aws-modules/iam/aws 5.30.0 for eks_addon_aws_ebs_csi_driver_iam_role...
- eks_addon_aws_ebs_csi_driver_iam_role in .terraform/modules/eks_addon_aws_ebs_csi_driver_iam_role/modules/iam-role-for-service-accounts-eks
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addon_internal_nginx_ingress_load_balancer...
- eks_addon_internal_nginx_ingress_load_balancer in .terraform/modules/eks_addon_internal_nginx_ingress_load_balancer
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addon_kubevela_controller...
- eks_addon_kubevela_controller in .terraform/modules/eks_addon_kubevela_controller
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addon_nginx_ingress_load_balancer...
- eks_addon_nginx_ingress_load_balancer in .terraform/modules/eks_addon_nginx_ingress_load_balancer
Downloading registry.terraform.io/aws-ia/eks-blueprints-addons/aws 1.9.2 for eks_addons...
- eks_addons in .terraform/modules/eks_addons
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.argo_events...
- eks_addons.argo_events in .terraform/modules/eks_addons.argo_events
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.argo_rollouts...
- eks_addons.argo_rollouts in .terraform/modules/eks_addons.argo_rollouts
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.argo_workflows...
- eks_addons.argo_workflows in .terraform/modules/eks_addons.argo_workflows
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.argocd...
- eks_addons.argocd in .terraform/modules/eks_addons.argocd
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_cloudwatch_metrics...
- eks_addons.aws_cloudwatch_metrics in .terraform/modules/eks_addons.aws_cloudwatch_metrics
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_efs_csi_driver...
- eks_addons.aws_efs_csi_driver in .terraform/modules/eks_addons.aws_efs_csi_driver
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_for_fluentbit...
- eks_addons.aws_for_fluentbit in .terraform/modules/eks_addons.aws_for_fluentbit
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_fsx_csi_driver...
- eks_addons.aws_fsx_csi_driver in .terraform/modules/eks_addons.aws_fsx_csi_driver
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_gateway_api_controller...
- eks_addons.aws_gateway_api_controller in .terraform/modules/eks_addons.aws_gateway_api_controller
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_load_balancer_controller...
- eks_addons.aws_load_balancer_controller in .terraform/modules/eks_addons.aws_load_balancer_controller
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_node_termination_handler...
- eks_addons.aws_node_termination_handler in .terraform/modules/eks_addons.aws_node_termination_handler
Downloading registry.terraform.io/terraform-aws-modules/sqs/aws 4.0.1 for eks_addons.aws_node_termination_handler_sqs...
- eks_addons.aws_node_termination_handler_sqs in .terraform/modules/eks_addons.aws_node_termination_handler_sqs
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.aws_privateca_issuer...
- eks_addons.aws_privateca_issuer in .terraform/modules/eks_addons.aws_privateca_issuer
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.cert_manager...
- eks_addons.cert_manager in .terraform/modules/eks_addons.cert_manager
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.cluster_autoscaler...
- eks_addons.cluster_autoscaler in .terraform/modules/eks_addons.cluster_autoscaler
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.cluster_proportional_autoscaler...
- eks_addons.cluster_proportional_autoscaler in .terraform/modules/eks_addons.cluster_proportional_autoscaler
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.external_dns...
- eks_addons.external_dns in .terraform/modules/eks_addons.external_dns
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.external_secrets...
- eks_addons.external_secrets in .terraform/modules/eks_addons.external_secrets
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.gatekeeper...
- eks_addons.gatekeeper in .terraform/modules/eks_addons.gatekeeper
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.ingress_nginx...
- eks_addons.ingress_nginx in .terraform/modules/eks_addons.ingress_nginx
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.karpenter...
- eks_addons.karpenter in .terraform/modules/eks_addons.karpenter
Downloading registry.terraform.io/terraform-aws-modules/sqs/aws 4.0.1 for eks_addons.karpenter_sqs...
- eks_addons.karpenter_sqs in .terraform/modules/eks_addons.karpenter_sqs
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.kube_prometheus_stack...
- eks_addons.kube_prometheus_stack in .terraform/modules/eks_addons.kube_prometheus_stack
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.metrics_server...
- eks_addons.metrics_server in .terraform/modules/eks_addons.metrics_server
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.secrets_store_csi_driver...
- eks_addons.secrets_store_csi_driver in .terraform/modules/eks_addons.secrets_store_csi_driver
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.secrets_store_csi_driver_provider_aws...
- eks_addons.secrets_store_csi_driver_provider_aws in .terraform/modules/eks_addons.secrets_store_csi_driver_provider_aws
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.velero...
- eks_addons.velero in .terraform/modules/eks_addons.velero
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for eks_addons.vpa...
- eks_addons.vpa in .terraform/modules/eks_addons.vpa
Downloading registry.terraform.io/aws-ia/eks-blueprints-addon/aws 1.1.1 for node_local_dns...
- node_local_dns in .terraform/modules/node_local_dns

Initializing provider plugins...
- Finding hashicorp/helm versions matching ">= 2.9.0"...
- Finding hashicorp/kubernetes versions matching ">= 2.20.0"...
- Finding hashicorp/time versions matching ">= 0.9.0"...
- Finding gavinbunney/kubectl versions matching "~> 1.14"...
- Finding hashicorp/aws versions matching ">= 4.0.0, >= 4.36.0, >= 4.47.0, >= 5.0.0"...
- Installing hashicorp/aws v5.35.0...
- Installed hashicorp/aws v5.35.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.12.1...
- Installed hashicorp/helm v2.12.1 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.25.2...
- Installed hashicorp/kubernetes v2.25.2 (signed by HashiCorp)
- Installing hashicorp/time v0.10.0...
- Installed hashicorp/time v0.10.0 (signed by HashiCorp)
- Installing gavinbunney/kubectl v1.14.0...
- Installed gavinbunney/kubectl v1.14.0 (self-signed, key ID AD64217B5ADD572F)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
╷
│ Error: could not read package directory: open .terraform/providers/registry.terraform.io/hashicorp/helm/2.12.1/linux_amd64: no such file or directory
│ 
│ 
╵
╷
│ Error: could not read package directory: open .terraform/providers/registry.terraform.io/hashicorp/kubernetes/2.25.2/linux_amd64: no such file or directory
│ 
│ 
╵
╷
│ Error: could not read package directory: open .terraform/providers/registry.terraform.io/gavinbunney/kubectl/1.14.0/linux_amd64: no such file or directory
│ 
│ 
╵
time=2024-02-02T13:15:12Z level=error msg=Terraform invocation failed in /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/cluster-addons/.terragrunt-cache/GqQG5g04SMO_YNaN-re6y98N_ns/HOCSoh3WcnZkrCzww4gGUwitycM prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/cluster-addons] 
time=2024-02-02T13:15:12Z level=error msg=1 error occurred:
	* [/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/cluster-addons/.terragrunt-cache/GqQG5g04SMO_YNaN-re6y98N_ns/HOCSoh3WcnZkrCzww4gGUwitycM] exit status 1




```
</details>

---
### 6. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/kubevela-addons": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/kubevela-addons": 
time=2024-02-02T13:15:12Z level=error msg=Error reading file at path /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/terragrunt.hcl: open /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/terragrunt.hcl: no such file or directory
time=2024-02-02T13:15:13Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 7. dir: `infra/us-east-1/prod/eks/green/eks` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/eks": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/eks": 
time=2024-02-02T13:15:17Z level=error msg=chdir /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/vpc/.terragrunt-cache/325961767: no such file or directory
time=2024-02-02T13:15:17Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 8. dir: `infra/us-east-1/prod/eks/green/eks-addons` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/eks-addons": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/eks-addons": 
time=2024-02-02T13:14:54Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/prod/eks/green/eks] 
time=2024-02-02T13:15:21Z level=error msg=chdir /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/global/route53/zones/.terragrunt-cache/3086906762: no such file or directory
time=2024-02-02T13:15:21Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 9. dir: `infra/us-east-1/dev/eks/kubevela-addons` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/kubevela-addons": exit status 1: running "terragrunt plan -input=false $(eval echo ${COMMENT_ARGS}) -out=${PLANFILE}" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/kubevela-addons": 
time=2024-02-02T13:12:38Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/cluster] 
time=2024-02-02T13:13:43Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/modules/kubevela-addons. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Finding gavinbunney/kubectl versions matching "~> 1.14"...
- Finding latest version of hashicorp/kubernetes...
- Finding latest version of hashicorp/helm...
- Installing gavinbunney/kubectl v1.14.0...
- Installed gavinbunney/kubectl v1.14.0 (self-signed, key ID AD64217B5ADD572F)
- Installing hashicorp/kubernetes v2.25.2...
- Installed hashicorp/kubernetes v2.25.2 (signed by HashiCorp)
- Installing hashicorp/helm v2.12.1...
- Installed hashicorp/helm v2.12.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.35.0...
- Installed hashicorp/aws v5.35.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster.cluster: Read complete after 1s [id=scde-dev-us-east-1]
helm_release.cardano[0]: Refreshing state... [id=cardano]
kubectl_manifest.traitdefinition_cardano_node_connector: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/cardano-node-connector]
kubectl_manifest.componentdefinition_helmrelease: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/componentdefinitions/helm]
kubectl_manifest.traitdefinition_bucket_user: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/bucket-user]
kubectl_manifest.traitdefinition_resource: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/resource]
data.kubectl_filename_list.manifests[0]: Reading...
kubectl_manifest.workflowtdefinition_build_nix_image: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/workflowstepdefinitions/build-nix-image]
kubectl_manifest.componentdefinition_bucket: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/componentdefinitions/bucket]
kubectl_manifest.traitdefinition_postgres_instance: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/postgres-instance]
data.kubectl_filename_list.manifests[0]: Read complete after 0s [id=52aa77eeab9646437de15dcf3c6fedd6dd104bebf39e2be50238c183fa76532d]
kubectl_manifest.componentdefinition_kustomize: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/componentdefinitions/kustomize]
kubectl_manifest.traitdefinition_cardano_wallet_connector: Refreshing state... [id=/apis/core.oam.dev/v1beta1/namespaces/vela-system/traitdefinitions/cardano-wallet-connector]
kubernetes_secret.dex-connector: Refreshing state... [id=vela-system/google]
kubernetes_manifest.traitdefinition_https_route: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # helm_release.cardano[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "helm_release" "cardano" {
      - atomic                     = false -> null
      - chart                      = "./cardano" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "cardano" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = ""
              - chart       = "cardano-node"
              - name        = "cardano"
              - namespace   = "vela-system"
              - revision    = 1
              - values      = jsonencode({})
              - version     = "v0.0.6"
            },
        ] -> null
      - name                       = "cardano" -> null
      - namespace                  = "vela-system" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "v0.0.6" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
╷
│ Error: Invalid function argument
│ 
│   on definitions.tf line 20, in resource "kubernetes_manifest" "traitdefinition_https_route":
│   20:           "template" = file("${path.module}/definitions/https-route.cue")
│     ├────────────────
│     │ while calling file(path)
│     │ path.module is "."
│ 
│ Invalid value for "path" parameter: no file exists at
│ "./definitions/https-route.cue"; this function works only with files that
│ are distributed as part of the configuration source code, so if this file
│ will be created by a resource in this configuration you must instead obtain
│ this result from an attribute of that resource.
╵
time=2024-02-02T13:15:29Z level=error msg=Terraform invocation failed in /atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/kubevela-addons/.terragrunt-cache/sq_ozxa2t9A5atBubjIu14YI81g/1XE0vmoL9ZUj3qglVYItfRnqW-I prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/kubevela-addons] 
time=2024-02-02T13:15:29Z level=error msg=1 error occurred:
	* [/atlantis-data/repos/input-output-hk/sc-dev-platform/132/default/infra/us-east-1/dev/eks/kubevela-addons/.terragrunt-cache/sq_ozxa2t9A5atBubjIu14YI81g/1XE0vmoL9ZUj3qglVYItfRnqW-I] exit status 1





```
</details>

---
### 10. dir: `infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.db_instance.aws_db_instance.this[0] has changed
!   resource "aws_db_instance" "this" {
        id                                    = "db-VMLILTQDTHC74YFBX44NISL4ZU"
!       status                                = "available" -> "stopped"
        # (54 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Changes to Outputs:
+   db_instance_domain_iam_role_name   = ""
!   db_instance_status                 = "available" -> "stopped"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Frds%252Fprod-marlowe-runtime-benchmark-db%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db`
</details>

**Note: Objects have changed outside of Terraform**

---
### 11. dir: `infra/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-0588935a949f9ff17" -> "ami-03c951bbe993ea087" # forces replacement
!       arn                                  = "arn:aws:ec2:us-east-1:677160962006:instance/i-018ffd73d7ff9a182" -> (known after apply)
!       associate_public_ip_address          = true -> (known after apply)
!       availability_zone                    = "us-east-1a" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 1 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
!       id                                   = "i-018ffd73d7ff9a182" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
!       monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-022335480577e8250" -> (known after apply)
!       private_dns                          = "ip-10-30-13-155.ec2.internal" -> (known after apply)
!       private_ip                           = "10.30.13.155" -> (known after apply)
!       public_dns                           = "ec2-18-232-130-127.compute-1.amazonaws.com" -> (known after apply)
!       public_ip                            = "18.232.130.127" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
!       tags                                 = {
-           "Environment"  = "prod" -> null
            "Name"         = "scde-marlowe-runtime-database-bastion"
-           "Project"      = "scde" -> null
-           "Resource"     = "scde-marlowe-runtime-database-bastion" -> null
-           "Terraform"    = "true" -> null
-           "environment"  = "prod" -> null
-           "function"     = "bastion" -> null
-           "organization" = "iog" -> null
-           "tribe"        = "smart-contracts" -> null
        }
!       tags_all                             = {
-           "Resource"     = "scde-marlowe-runtime-database-bastion" -> null
-           "environment"  = "prod" -> null
-           "function"     = "bastion" -> null
-           "organization" = "iog" -> null
-           "tribe"        = "smart-contracts" -> null
            # (6 unchanged elements hidden)
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
!       vpc_security_group_ids               = [
+           "sg-03a0d7b20aa045f75",
            # (1 unchanged element hidden)
        ]
        # (7 unchanged attributes hidden)

-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 1 -> null
        }

!       credit_specification {
-           cpu_credits = "standard" -> null
        }

!       enclave_options {
!           enabled = false -> (known after apply)
        }

-       maintenance_options {
-           auto_recovery = "default" -> null
        }

!       metadata_options {
!           instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/xvda" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-0c4ac8dc4e3ce03a7" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   ami                                = "ami-0588935a949f9ff17" -> "ami-03c951bbe993ea087"
!   arn                                = "arn:aws:ec2:us-east-1:677160962006:instance/i-018ffd73d7ff9a182" -> (known after apply)
!   capacity_reservation_specification = [
-       {
-           capacity_reservation_preference = "open"
-           capacity_reservation_target     = []
        },
    ] -> (known after apply)
!   ebs_block_device                   = [] -> (known after apply)
!   ephemeral_block_device             = [] -> (known after apply)
!   id                                 = "i-018ffd73d7ff9a182" -> (known after apply)
!   instance_state                     = "running" -> (known after apply)
!   ipv6_addresses                     = [] -> (known after apply)
!   outpost_arn                        = "" -> (known after apply)
!   password_data                      = "" -> (known after apply)
!   primary_network_interface_id       = "eni-022335480577e8250" -> (known after apply)
!   private_dns                        = "ip-10-30-13-155.ec2.internal" -> (known after apply)
!   private_ip                         = "10.30.13.155" -> (known after apply)
!   public_dns                         = "ec2-18-232-130-127.compute-1.amazonaws.com" -> (known after apply)
!   public_ip                          = "18.232.130.127" -> (known after apply)
!   root_block_device                  = [
-       {
-           delete_on_termination = true
-           device_name           = "/dev/xvda"
-           encrypted             = false
-           iops                  = 100
-           kms_key_id            = ""
-           tags                  = {}
-           throughput            = 0
-           volume_id             = "vol-0c4ac8dc4e3ce03a7"
-           volume_size           = 8
-           volume_type           = "gp2"
        },
    ] -> (known after apply)
!   tags_all                           = {
-       Resource     = "scde-marlowe-runtime-database-bastion"
-       environment  = "prod"
-       function     = "bastion"
-       organization = "iog"
-       tribe        = "smart-contracts"
        # (6 unchanged attributes hidden)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/rds/bastion/ec2-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Frds%252Fbastion%252Fec2-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/rds/bastion/ec2-instance`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`